test interactive graphs in github
